SigninLogs
| where ResultType == 0
| summarize LoginCount = count(), Locations = make_set(Location), IPAddresses = make_set(IPAddress) by UserPrincipalName, bin(TimeGenerated, 1h)
| where array_length(Locations) > 1
| sort by LoginCount desc
